# Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов.
# Используйте для решения задачи метод count.

my_str = str(input())

print((my_str.count(" ")) + 1)
